Tekla Open API Reference for Tekla Structures 2025
SeamInputTypeAttribute.Type Property
 The custom attribute [SeamInputType()] uses this to store the input type to the system. This is not to be used by itself.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ConnectionBase.SeamInputType Type { get; }
Public ReadOnly Property Type As ConnectionBase.SeamInputType
	Get
Property Value
Type: ConnectionBase.SeamInputType
See Also
Reference
SeamInputTypeAttribute Class
Tekla.Structures.Plugins Namespace